Repository: GabrieleBattaglia/cwapu
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: it

source: Counting results
it: Conteggio dei risultati

source: Set Hertz
it: Imposta Hertz

source: Listen to clipboard
it: Ascolta CW dagli appunti

source: shows Menu
it: Mostra menu

source: To quit this app
it: Per chiudere l'app

source: Receiving exercise
it: Esercizio di ricezione

source: Set speed
it: Imposta velocità

source: Transmitting exercise
it: Esercizio di trasmissione

source: Words Creator
it: Crea dizionario

source: Call-like
it: Simile a un nominativo (pseudo-call)

source: Groups
it: Gruppi

source: Letters only (A to Z)
it: Solo lettere (da A a Z)

source: Numbers only (0 to 9)
it: Solo numeri (da 0 a 9)

source: Letters and Numbers (A to Z and 0 to 9)
it: Lettere e numeri (da A a Z e da 0 a 9)

source: Custom set (let's decide which symbols you want to work on)
it: Set personalizzato (decidiamo quali simboli vuoi usare)

source: Words (words peeked up from a customizable file)
it: Parole (scelte da un dizionario personalizzabile)

source: Attention! Please read carefully. For the reception exercises, (r) from the main menu, CWAPU uses the file words.txt, which must be located in the folder from which you launched cwapu.py or cwapu.exe. If this file does not exist, create one with a text editor and write some words in it, one word per line, then save it. The WordsCreator procedure allows you to scan all the txt files contained in the folders you indicate and add all the words from those files to words.txt. The words will be added uniquely, meaning they will all be different from each other. The file produced by this process will be named words_updated.txt. Check it with a text editor and, if you are satisfied with it, rename it to words.txt, replacing the existing words.txt. You can repeat this operation as many times as you like: words_updated.txt will contain the words from words.txt plus all those collected from the newly processed .txt files.
it: Attenzione! Si prega di leggere attentamente. Per l'esercizio di ricezione (r.2.5) dal menu principale, CWAPU utilizza il file words.txt, che deve trovarsi nella cartella da cui hai avviato cwapu.py o cwapu.exe. Se questo file non esiste, creane uno con un editor di testo e scrivi alcune parole, una per riga, poi salvalo. La procedura Crea Dizionario consente di scansionare tutti i file txt nelle cartelle che indichi e aggiungere tutte le parole da quei file a words.txt. Le parole verranno aggiunte unicamente, cioè saranno tutte diverse tra loro. Il file prodotto da questo processo sarà denominato words_updated.txt. Verificalo con un editor di testo e, se sei soddisfatto, rinominalo in words.txt, sostituendo il words.txt esistente. Puoi ripetere questa operazione tutte le volte che desideri: words_updated.txt conterrà le parole di words.txt più tutte quelle raccolte dai nuovi file .txt elaborati.

source: Let's filter the words set to using with the exercise Please type minimum.maximum length of the words you want to be choosen randomly. e.g. 3.6 will choose words with length in between 3 and 6 characters only. Type enter to use the whole dictonary
it: Filtriamo l'insieme delle parole da usare con l'esercizio Indica la lunghezza minima.massima delle parole da scegliere casualmente. Es. 3.6 sceglierà solo parole di lunghezza compresa tra 3 e 6 caratteri. Premi invio per usare l'intero dizionario

source: You havn't inserted numbers
it: Non hai inserito numeri

source: Try again
it: Riprova

source: Type all characters you want to practice on. (minimum of 2) Empty line to proceed
it: Digita tutti i caratteri su cui vuoi esercitarti. (minimo 2) invio per procedere

source: Transmitting exercise. Here you're going to have random calls-like and numbers, try to play them on your favourite CW key. Any key to go on, ESCAPE to close the App.
it: Esercizio di trasmissione. Qui avrai nominativi casuali e numeri, Premi un tasto qualsiasi per continuare, ESC per chiudere l'app.

source: Bye-Bye & 73. de IZ4APU Gabe, back to main menu.
it: Arrivederci & 73. de IZ4APU Gabe, ritorno al menu principale.

source: Counting, YES or NO?. Spacebar means: group received; Any other key means: group lost; Press ESCAPE to go back to main menu.
it: Conteggio, SÌ o NO?. Barra spaziatrice: gruppo ricevuto; Qualsiasi altro tasto: gruppo perso; Premi ESC per tornare al menu principale.

source: Passed!
it: Superato!

source: Report saved on CW_Diary.txt
it: Rapporto salvato in CW_Diary.txt

source: Got it!
it: Ricevuto!

source: Note: empty ***
it: Nota: vuota ***

source: Bye for now, back to main menu.
it: Ciao per ora, ritorno al menu principale.

source: Time to receive? Yep, you're to the right place. Let's go! Loading the status of your progress and check for dictonary database...
it: E' l'ora giusta per un bel allenamento in ricezione? Sì, sei nel posto giusto. Andiamo! Caricamento dello stato dei tuoi progressi e verifica del database del dizionario...

source: File words.txt not found. Please provide a dictionary file: 1 word per line.
it: File words.txt non trovato. Fornisci un file di dizionario: 1 parola per riga.

source: Ups, this is your first class, probably. So I'm creating the record.
it: Ops, questa è probabilmente la tua prima lezione. Sto creando il record.

source: Now select which exercise do you want to take:
it: Ora seleziona quale esercizio desideri fare:

source: It's over! Now let me check what we've got.
it: È finito! Ora lascia che controlli cosa abbiamo ottenuto.

source: Character: mistakes = Percentage
it: Carattere: errori = Percentuale

source: Never misspelled characters:
it: Caratteri mai sbagliati:

source: List of wrong received words:
it: Lista delle stringhe ricevute scorrettamente:

source: Note: empty ***
it: Nota: vuota ***

source: I hope to see you soon - 73 de IZ4APU TU EE
it: Spero di rivederti presto - 73 de IZ4APU TU EE
